app/controllers/members_controller.rb

SELECT "members".* FROM "members" WHERE "members"."is_alumni" = 'f' ORDER BY fname, lname
---
  def index
    @members = Member.scoped(:order => "fname, lname")
    unless @current_member
      @members = @members.find(:all, :conditions => {:is_alumni => false})